Microchip-MPLAB-Harmony/reference_apps/apps/pic32cx_sg41_cult/pic32cx_sg41_getting_started/firmware/src/packs/PIC32CX1025SG41128_DFP/pio/pic32cx1025sg41128.h
#define PIN_PA06N_CCL_IN2                          _UINT32_(6) 
#define MUX_PA06N_CCL_IN2                          _UINT32_(13)
#define PINMUX_PA06N_CCL_IN2                       ((PIN_PA06N_CCL_IN2 << 16) | MUX_PA06N_CCL_IN2)
#define PORT_PA06N_CCL_IN2                         (_UINT32_(1) << 6)

#define PIN_PA18N_CCL_IN2                          _UINT32_(18)
#define MUX_PA18N_CCL_IN2                          _UINT32_(13)
#define PINMUX_PA18N_CCL_IN2                       ((PIN_PA18N_CCL_IN2 << 16) | MUX_PA18N_CCL_IN2)
#define PORT_PA18N_CCL_IN2                         (_UINT32_(1) << 18)

#define PIN_PB01N_CCL_IN2                          _UINT32_(33)
#define MUX_PB01N_CCL_IN2                          _UINT32_(13)
#define PINMUX_PB01N_CCL_IN2                       ((PIN_PB01N_CCL_IN2 << 16) | MUX_PB01N_CCL_IN2)
#define PORT_PB01N_CCL_IN2                         (_UINT32_(1) << 1)

#define PIN_PA08N_CCL_IN3                          _UINT32_(8) 
#define MUX_PA08N_CCL_IN3                          _UINT32_(13)
#define PINMUX_PA08N_CCL_IN3                       ((PIN_PA08N_CCL_IN3 << 16) | MUX_PA08N_CCL_IN3)
#define PORT_PA08N_CCL_IN3                         (_UINT32_(1) << 8)

#define PIN_PA30N_CCL_IN3                          _UINT32_(30)
#define MUX_PA30N_CCL_IN3                          _UINT32_(13)
#define PINMUX_PA30N_CCL_IN3                       ((PIN_PA30N_CCL_IN3 << 16) | MUX_PA30N_CCL_IN3)
#define PORT_PA30N_CCL_IN3                         (_UINT32_(1) << 30)

#define PIN_PA09N_CCL_IN4                          _UINT32_(9) 
#define MUX_PA09N_CCL_IN4                          _UINT32_(13)
#define PINMUX_PA09N_CCL_IN4                       ((PIN_PA09N_CCL_IN4 << 16) | MUX_PA09N_CCL_IN4)
#define PORT_PA09N_CCL_IN4                         (_UINT32_(1) << 9)

#define PIN_PC27N_CCL_IN4                          _UINT32_(91)
#define MUX_PC27N_CCL_IN4                          _UINT32_(13)
#define PINMUX_PC27N_CCL_IN4                       ((PIN_PC27N_CCL_IN4 << 16) | MUX_PC27N_CCL_IN4)
#define PORT_PC27N_CCL_IN4                         (_UINT32_(1) << 27)

#define PIN_PA10N_CCL_IN5                          _UINT32_(10)
#define MUX_PA10N_CCL_IN5                          _UINT32_(13)
#define PINMUX_PA10N_CCL_IN5                       ((PIN_PA10N_CCL_IN5 << 16) | MUX_PA10N_CCL_IN5)
#define PORT_PA10N_CCL_IN5                         (_UINT32_(1) << 10)

#define PIN_PC28N_CCL_IN5                          _UINT32_(92)
#define MUX_PC28N_CCL_IN5                          _UINT32_(13)
#define PINMUX_PC28N_CCL_IN5                       ((PIN_PC28N_CCL_IN5 << 16) | MUX_PC28N_CCL_IN5)
#define PORT_PC28N_CCL_IN5                         (_UINT32_(1) << 28)

#define PIN_PA22N_CCL_IN6                          _UINT32_(22)
#define MUX_PA22N_CCL_IN6                          _UINT32_(13)
#define PINMUX_PA22N_CCL_IN6                       ((PIN_PA22N_CCL_IN6 << 16) | MUX_PA22N_CCL_IN6)
#define PORT_PA22N_CCL_IN6                         (_UINT32_(1) << 22)

#define PIN_PB06N_CCL_IN6                          _UINT32_(38)
#define MUX_PB06N_CCL_IN6                          _UINT32_(13)
#define PINMUX_PB06N_CCL_IN6                       ((PIN_PB06N_CCL_IN6 << 16) | MUX_PB06N_CCL_IN6)
#define PORT_PB06N_CCL_IN6                         (_UINT32_(1) << 6)

#define PIN_PA23N_CCL_IN7                          _UINT32_(23)
#define MUX_PA23N_CCL_IN7                          _UINT32_(13)
#define PINMUX_PA23N_CCL_IN7                       ((PIN_PA23N_CCL_IN7 << 16) | MUX_PA23N_CCL_IN7)
#define PORT_PA23N_CCL_IN7                         (_UINT32_(1) << 23)

#define PIN_PB07N_CCL_IN7                          _UINT32_(39)
#define MUX_PB07N_CCL_IN7                          _UINT32_(13)
#define PINMUX_PB07N_CCL_IN7                       ((PIN_PB07N_CCL_IN7 << 16) | MUX_PB07N_CCL_IN7)
#define PORT_PB07N_CCL_IN7                         (_UINT32_(1) << 7)

#define PIN_PA24N_CCL_IN8                          _UINT32_(24)
#define MUX_PA24N_CCL_IN8                          _UINT32_(13)
#define PINMUX_PA24N_CCL_IN8                       ((PIN_PA24N_CCL_IN8 << 16) | MUX_PA24N_CCL_IN8)
#define PORT_PA24N_CCL_IN8                         (_UINT32_(1) << 24)

#define PIN_PB08N_CCL_IN8                          _UINT32_(40)
#define MUX_PB08N_CCL_IN8                          _UINT32_(13)
#define PINMUX_PB08N_CCL_IN8                       ((PIN_PB08N_CCL_IN8 << 16) | MUX_PB08N_CCL_IN8)
#define PORT_PB08N_CCL_IN8                         (_UINT32_(1) << 8)

#define PIN_PB14N_CCL_IN9                          _UINT32_(46)
#define MUX_PB14N_CCL_IN9                          _UINT32_(13)
#define PINMUX_PB14N_CCL_IN9                       ((PIN_PB14N_CCL_IN9 << 16) | MUX_PB14N_CCL_IN9)
#define PORT_PB14N_CCL_IN9                         (_UINT32_(1) << 14)

#define PIN_PC20N_CCL_IN9                          _UINT32_(84)
#define MUX_PC20N_CCL_IN9                          _UINT32_(13)
#define PINMUX_PC20N_CCL_IN9                       ((PIN_PC20N_CCL_IN9 << 16) | MUX_PC20N_CCL_IN9)
#define PORT_PC20N_CCL_IN9                         (_UINT32_(1) << 20)

#define PIN_PB15N_CCL_IN10                         _UINT32_(47)
#define MUX_PB15N_CCL_IN10                         _UINT32_(13)
#define PINMUX_PB15N_CCL_IN10                      ((PIN_PB15N_CCL_IN10 << 16) | MUX_PB15N_CCL_IN10)
#define PORT_PB15N_CCL_IN10                        (_UINT32_(1) << 15)

#define PIN_PC21N_CCL_IN10                         _UINT32_(85)
#define MUX_PC21N_CCL_IN10                         _UINT32_(13)
#define PINMUX_PC21N_CCL_IN10                      ((PIN_PC21N_CCL_IN10 << 16) | MUX_PC21N_CCL_IN10)
#define PORT_PC21N_CCL_IN10                        (_UINT32_(1) << 21)

#define PIN_PB10N_CCL_IN11                         _UINT32_(42)
#define MUX_PB10N_CCL_IN11                         _UINT32_(13)
#define PINMUX_PB10N_CCL_IN11                      ((PIN_PB10N_CCL_IN11 << 16) | MUX_PB10N_CCL_IN11)
#define PORT_PB10N_CCL_IN11                        (_UINT32_(1) << 10)

#define PIN_PB16N_CCL_IN11                         _UINT32_(48)
#define MUX_PB16N_CCL_IN11                         _UINT32_(13)
#define PINMUX_PB16N_CCL_IN11                      ((PIN_PB16N_CCL_IN11 << 16) | MUX_PB16N_CCL_IN11)
#define PORT_PB16N_CCL_IN11                        (_UINT32_(1) << 16)

#define PIN_PA07N_CCL_OUT0                         _UINT32_(7) 
#define MUX_PA07N_CCL_OUT0                         _UINT32_(13)
#define PINMUX_PA07N_CCL_OUT0                      ((PIN_PA07N_CCL_OUT0 << 16) | MUX_PA07N_CCL_OUT0)
#define PORT_PA07N_CCL_OUT0                        (_UINT32_(1) << 7)

#define PIN_PA19N_CCL_OUT0                         _UINT32_(19)
#define MUX_PA19N_CCL_OUT0                         _UINT32_(13)
#define PINMUX_PA19N_CCL_OUT0                      ((PIN_PA19N_CCL_OUT0 << 16) | MUX_PA19N_CCL_OUT0)
#define PORT_PA19N_CCL_OUT0                        (_UINT32_(1) << 19)

#define PIN_PB02N_CCL_OUT0                         _UINT32_(34)
#define MUX_PB02N_CCL_OUT0                         _UINT32_(13)
#define PINMUX_PB02N_CCL_OUT0                      ((PIN_PB02N_CCL_OUT0 << 16) | MUX_PB02N_CCL_OUT0)
#define PORT_PB02N_CCL_OUT0                        (_UINT32_(1) << 2)

#define PIN_PB23N_CCL_OUT0                         _UINT32_(55)
#define MUX_PB23N_CCL_OUT0                         _UINT32_(13)
#define PINMUX_PB23N_CCL_OUT0                      ((PIN_PB23N_CCL_OUT0 << 16) | MUX_PB23N_CCL_OUT0)
#define PORT_PB23N_CCL_OUT0                        (_UINT32_(1) << 23)

#define PIN_PA11N_CCL_OUT1                         _UINT32_(11)
#define MUX_PA11N_CCL_OUT1                         _UINT32_(13)
#define PINMUX_PA11N_CCL_OUT1                      ((PIN_PA11N_CCL_OUT1 << 16) | MUX_PA11N_CCL_OUT1)
#define PORT_PA11N_CCL_OUT1                        (_UINT32_(1) << 11)

#define PIN_PA31N_CCL_OUT1                         _UINT32_(31)
#define MUX_PA31N_CCL_OUT1                         _UINT32_(13)
#define PINMUX_PA31N_CCL_OUT1                      ((PIN_PA31N_CCL_OUT1 << 16) | MUX_PA31N_CCL_OUT1)
#define PORT_PA31N_CCL_OUT1                        (_UINT32_(1) << 31)

#define PIN_PB11N_CCL_OUT1                         _UINT32_(43)
#define MUX_PB11N_CCL_OUT1                         _UINT32_(13)
#define PINMUX_PB11N_CCL_OUT1                      ((PIN_PB11N_CCL_OUT1 << 16) | MUX_PB11N_CCL_OUT1)
#define PORT_PB11N_CCL_OUT1                        (_UINT32_(1) << 11)

