Microchip-MPLAB-Harmony/reference_apps/apps/pic32cx_sg41_cult/pic32cx_sg41_getting_started/firmware/src/packs/PIC32CX1025SG41128_DFP/pio/pic32cx1025sg41128.h
#define PIN_PB29A_EIC_EXTINT15                     _UINT32_(61)
#define MUX_PB29A_EIC_EXTINT15                     _UINT32_(0) 
#define PINMUX_PB29A_EIC_EXTINT15                  ((PIN_PB29A_EIC_EXTINT15 << 16) | MUX_PB29A_EIC_EXTINT15)
#define PORT_PB29A_EIC_EXTINT15                    (_UINT32_(1) << 29)
#define PIN_PB29A_EIC_EXTINT_NUM                   _UINT32_(15) /* EIC signal: PIN_PB29 External Interrupt Line */

#define PIN_PB31A_EIC_EXTINT15                     _UINT32_(63)
#define MUX_PB31A_EIC_EXTINT15                     _UINT32_(0) 
#define PINMUX_PB31A_EIC_EXTINT15                  ((PIN_PB31A_EIC_EXTINT15 << 16) | MUX_PB31A_EIC_EXTINT15)
#define PORT_PB31A_EIC_EXTINT15                    (_UINT32_(1) << 31)
#define PIN_PB31A_EIC_EXTINT_NUM                   _UINT32_(15) /* EIC signal: PIN_PB31 External Interrupt Line */

#define PIN_PC15A_EIC_EXTINT15                     _UINT32_(79)
#define MUX_PC15A_EIC_EXTINT15                     _UINT32_(0) 
#define PINMUX_PC15A_EIC_EXTINT15                  ((PIN_PC15A_EIC_EXTINT15 << 16) | MUX_PC15A_EIC_EXTINT15)
#define PORT_PC15A_EIC_EXTINT15                    (_UINT32_(1) << 15)
#define PIN_PC15A_EIC_EXTINT_NUM                   _UINT32_(15) /* EIC signal: PIN_PC15 External Interrupt Line */

#define PIN_PC31A_EIC_EXTINT15                     _UINT32_(95)
#define MUX_PC31A_EIC_EXTINT15                     _UINT32_(0) 
#define PINMUX_PC31A_EIC_EXTINT15                  ((PIN_PC31A_EIC_EXTINT15 << 16) | MUX_PC31A_EIC_EXTINT15)
#define PORT_PC31A_EIC_EXTINT15                    (_UINT32_(1) << 31)
#define PIN_PC31A_EIC_EXTINT_NUM                   _UINT32_(15) /* EIC signal: PIN_PC31 External Interrupt Line */

#define PIN_PA08A_EIC_NMI                          _UINT32_(8) 
#define MUX_PA08A_EIC_NMI                          _UINT32_(0) 
#define PINMUX_PA08A_EIC_NMI                       ((PIN_PA08A_EIC_NMI << 16) | MUX_PA08A_EIC_NMI)
#define PORT_PA08A_EIC_NMI                         (_UINT32_(1) << 8)

/* ========== PORT definition for GCLK peripheral ========== */
#define PIN_PA30M_GCLK_IO0                         _UINT32_(30)
#define MUX_PA30M_GCLK_IO0                         _UINT32_(12)
#define PINMUX_PA30M_GCLK_IO0                      ((PIN_PA30M_GCLK_IO0 << 16) | MUX_PA30M_GCLK_IO0)
#define PORT_PA30M_GCLK_IO0                        (_UINT32_(1) << 30)

#define PIN_PB14M_GCLK_IO0                         _UINT32_(46)
#define MUX_PB14M_GCLK_IO0                         _UINT32_(12)
#define PINMUX_PB14M_GCLK_IO0                      ((PIN_PB14M_GCLK_IO0 << 16) | MUX_PB14M_GCLK_IO0)
#define PORT_PB14M_GCLK_IO0                        (_UINT32_(1) << 14)

#define PIN_PA14M_GCLK_IO0                         _UINT32_(14)
#define MUX_PA14M_GCLK_IO0                         _UINT32_(12)
#define PINMUX_PA14M_GCLK_IO0                      ((PIN_PA14M_GCLK_IO0 << 16) | MUX_PA14M_GCLK_IO0)
#define PORT_PA14M_GCLK_IO0                        (_UINT32_(1) << 14)

#define PIN_PB22M_GCLK_IO0                         _UINT32_(54)
#define MUX_PB22M_GCLK_IO0                         _UINT32_(12)
#define PINMUX_PB22M_GCLK_IO0                      ((PIN_PB22M_GCLK_IO0 << 16) | MUX_PB22M_GCLK_IO0)
#define PORT_PB22M_GCLK_IO0                        (_UINT32_(1) << 22)

#define PIN_PB15M_GCLK_IO1                         _UINT32_(47)
#define MUX_PB15M_GCLK_IO1                         _UINT32_(12)
#define PINMUX_PB15M_GCLK_IO1                      ((PIN_PB15M_GCLK_IO1 << 16) | MUX_PB15M_GCLK_IO1)
#define PORT_PB15M_GCLK_IO1                        (_UINT32_(1) << 15)

#define PIN_PA15M_GCLK_IO1                         _UINT32_(15)
#define MUX_PA15M_GCLK_IO1                         _UINT32_(12)
#define PINMUX_PA15M_GCLK_IO1                      ((PIN_PA15M_GCLK_IO1 << 16) | MUX_PA15M_GCLK_IO1)
#define PORT_PA15M_GCLK_IO1                        (_UINT32_(1) << 15)

#define PIN_PB23M_GCLK_IO1                         _UINT32_(55)
#define MUX_PB23M_GCLK_IO1                         _UINT32_(12)
#define PINMUX_PB23M_GCLK_IO1                      ((PIN_PB23M_GCLK_IO1 << 16) | MUX_PB23M_GCLK_IO1)
#define PORT_PB23M_GCLK_IO1                        (_UINT32_(1) << 23)

#define PIN_PA27M_GCLK_IO1                         _UINT32_(27)
#define MUX_PA27M_GCLK_IO1                         _UINT32_(12)
#define PINMUX_PA27M_GCLK_IO1                      ((PIN_PA27M_GCLK_IO1 << 16) | MUX_PA27M_GCLK_IO1)
#define PORT_PA27M_GCLK_IO1                        (_UINT32_(1) << 27)

#define PIN_PA16M_GCLK_IO2                         _UINT32_(16)
#define MUX_PA16M_GCLK_IO2                         _UINT32_(12)
#define PINMUX_PA16M_GCLK_IO2                      ((PIN_PA16M_GCLK_IO2 << 16) | MUX_PA16M_GCLK_IO2)
#define PORT_PA16M_GCLK_IO2                        (_UINT32_(1) << 16)

#define PIN_PB16M_GCLK_IO2                         _UINT32_(48)
#define MUX_PB16M_GCLK_IO2                         _UINT32_(12)
#define PINMUX_PB16M_GCLK_IO2                      ((PIN_PB16M_GCLK_IO2 << 16) | MUX_PB16M_GCLK_IO2)
#define PORT_PB16M_GCLK_IO2                        (_UINT32_(1) << 16)

#define PIN_PA17M_GCLK_IO3                         _UINT32_(17)
#define MUX_PA17M_GCLK_IO3                         _UINT32_(12)
#define PINMUX_PA17M_GCLK_IO3                      ((PIN_PA17M_GCLK_IO3 << 16) | MUX_PA17M_GCLK_IO3)
#define PORT_PA17M_GCLK_IO3                        (_UINT32_(1) << 17)

#define PIN_PB17M_GCLK_IO3                         _UINT32_(49)
#define MUX_PB17M_GCLK_IO3                         _UINT32_(12)
#define PINMUX_PB17M_GCLK_IO3                      ((PIN_PB17M_GCLK_IO3 << 16) | MUX_PB17M_GCLK_IO3)
#define PORT_PB17M_GCLK_IO3                        (_UINT32_(1) << 17)

#define PIN_PA10M_GCLK_IO4                         _UINT32_(10)
#define MUX_PA10M_GCLK_IO4                         _UINT32_(12)
#define PINMUX_PA10M_GCLK_IO4                      ((PIN_PA10M_GCLK_IO4 << 16) | MUX_PA10M_GCLK_IO4)
#define PORT_PA10M_GCLK_IO4                        (_UINT32_(1) << 10)

#define PIN_PB10M_GCLK_IO4                         _UINT32_(42)
#define MUX_PB10M_GCLK_IO4                         _UINT32_(12)
#define PINMUX_PB10M_GCLK_IO4                      ((PIN_PB10M_GCLK_IO4 << 16) | MUX_PB10M_GCLK_IO4)
#define PORT_PB10M_GCLK_IO4                        (_UINT32_(1) << 10)

