Microchip-MPLAB-Harmony/reference_apps/apps/pic32cx_sg41_cult/pic32cx_sg41_getting_started/firmware/src/packs/PIC32CX1025SG41128_DFP/pio/pic32cx1025sg41128.h
#define PIN_PC12C_SERCOM7_PAD0                     _UINT32_(76)
#define MUX_PC12C_SERCOM7_PAD0                     _UINT32_(2) 
#define PINMUX_PC12C_SERCOM7_PAD0                  ((PIN_PC12C_SERCOM7_PAD0 << 16) | MUX_PC12C_SERCOM7_PAD0)
#define PORT_PC12C_SERCOM7_PAD0                    (_UINT32_(1) << 12)

#define PIN_PB20D_SERCOM7_PAD1                     _UINT32_(52)
#define MUX_PB20D_SERCOM7_PAD1                     _UINT32_(3) 
#define PINMUX_PB20D_SERCOM7_PAD1                  ((PIN_PB20D_SERCOM7_PAD1 << 16) | MUX_PB20D_SERCOM7_PAD1)
#define PORT_PB20D_SERCOM7_PAD1                    (_UINT32_(1) << 20)

#define PIN_PD09C_SERCOM7_PAD1                     _UINT32_(105)
#define MUX_PD09C_SERCOM7_PAD1                     _UINT32_(2) 
#define PINMUX_PD09C_SERCOM7_PAD1                  ((PIN_PD09C_SERCOM7_PAD1 << 16) | MUX_PD09C_SERCOM7_PAD1)
#define PORT_PD09C_SERCOM7_PAD1                    (_UINT32_(1) << 9)

#define PIN_PB31C_SERCOM7_PAD1                     _UINT32_(63)
#define MUX_PB31C_SERCOM7_PAD1                     _UINT32_(2) 
#define PINMUX_PB31C_SERCOM7_PAD1                  ((PIN_PB31C_SERCOM7_PAD1 << 16) | MUX_PB31C_SERCOM7_PAD1)
#define PORT_PB31C_SERCOM7_PAD1                    (_UINT32_(1) << 31)

#define PIN_PC13C_SERCOM7_PAD1                     _UINT32_(77)
#define MUX_PC13C_SERCOM7_PAD1                     _UINT32_(2) 
#define PINMUX_PC13C_SERCOM7_PAD1                  ((PIN_PC13C_SERCOM7_PAD1 << 16) | MUX_PC13C_SERCOM7_PAD1)
#define PORT_PC13C_SERCOM7_PAD1                    (_UINT32_(1) << 13)

#define PIN_PB18D_SERCOM7_PAD2                     _UINT32_(50)
#define MUX_PB18D_SERCOM7_PAD2                     _UINT32_(3) 
#define PINMUX_PB18D_SERCOM7_PAD2                  ((PIN_PB18D_SERCOM7_PAD2 << 16) | MUX_PB18D_SERCOM7_PAD2)
#define PORT_PB18D_SERCOM7_PAD2                    (_UINT32_(1) << 18)

#define PIN_PC10D_SERCOM7_PAD2                     _UINT32_(74)
#define MUX_PC10D_SERCOM7_PAD2                     _UINT32_(3) 
#define PINMUX_PC10D_SERCOM7_PAD2                  ((PIN_PC10D_SERCOM7_PAD2 << 16) | MUX_PC10D_SERCOM7_PAD2)
#define PORT_PC10D_SERCOM7_PAD2                    (_UINT32_(1) << 10)

#define PIN_PC14C_SERCOM7_PAD2                     _UINT32_(78)
#define MUX_PC14C_SERCOM7_PAD2                     _UINT32_(2) 
#define PINMUX_PC14C_SERCOM7_PAD2                  ((PIN_PC14C_SERCOM7_PAD2 << 16) | MUX_PC14C_SERCOM7_PAD2)
#define PORT_PC14C_SERCOM7_PAD2                    (_UINT32_(1) << 14)

#define PIN_PD10C_SERCOM7_PAD2                     _UINT32_(106)
#define MUX_PD10C_SERCOM7_PAD2                     _UINT32_(2) 
#define PINMUX_PD10C_SERCOM7_PAD2                  ((PIN_PD10C_SERCOM7_PAD2 << 16) | MUX_PD10C_SERCOM7_PAD2)
#define PORT_PD10C_SERCOM7_PAD2                    (_UINT32_(1) << 10)

#define PIN_PA30C_SERCOM7_PAD2                     _UINT32_(30)
#define MUX_PA30C_SERCOM7_PAD2                     _UINT32_(2) 
#define PINMUX_PA30C_SERCOM7_PAD2                  ((PIN_PA30C_SERCOM7_PAD2 << 16) | MUX_PA30C_SERCOM7_PAD2)
#define PORT_PA30C_SERCOM7_PAD2                    (_UINT32_(1) << 30)

#define PIN_PB19D_SERCOM7_PAD3                     _UINT32_(51)
#define MUX_PB19D_SERCOM7_PAD3                     _UINT32_(3) 
#define PINMUX_PB19D_SERCOM7_PAD3                  ((PIN_PB19D_SERCOM7_PAD3 << 16) | MUX_PB19D_SERCOM7_PAD3)
#define PORT_PB19D_SERCOM7_PAD3                    (_UINT32_(1) << 19)

#define PIN_PC11D_SERCOM7_PAD3                     _UINT32_(75)
#define MUX_PC11D_SERCOM7_PAD3                     _UINT32_(3) 
#define PINMUX_PC11D_SERCOM7_PAD3                  ((PIN_PC11D_SERCOM7_PAD3 << 16) | MUX_PC11D_SERCOM7_PAD3)
#define PORT_PC11D_SERCOM7_PAD3                    (_UINT32_(1) << 11)

#define PIN_PC15C_SERCOM7_PAD3                     _UINT32_(79)
#define MUX_PC15C_SERCOM7_PAD3                     _UINT32_(2) 
#define PINMUX_PC15C_SERCOM7_PAD3                  ((PIN_PC15C_SERCOM7_PAD3 << 16) | MUX_PC15C_SERCOM7_PAD3)
#define PORT_PC15C_SERCOM7_PAD3                    (_UINT32_(1) << 15)

#define PIN_PD11C_SERCOM7_PAD3                     _UINT32_(107)
#define MUX_PD11C_SERCOM7_PAD3                     _UINT32_(2) 
#define PINMUX_PD11C_SERCOM7_PAD3                  ((PIN_PD11C_SERCOM7_PAD3 << 16) | MUX_PD11C_SERCOM7_PAD3)
#define PORT_PD11C_SERCOM7_PAD3                    (_UINT32_(1) << 11)

#define PIN_PA31C_SERCOM7_PAD3                     _UINT32_(31)
#define MUX_PA31C_SERCOM7_PAD3                     _UINT32_(2) 
#define PINMUX_PA31C_SERCOM7_PAD3                  ((PIN_PA31C_SERCOM7_PAD3 << 16) | MUX_PA31C_SERCOM7_PAD3)
#define PORT_PA31C_SERCOM7_PAD3                    (_UINT32_(1) << 31)

/* ========== PORT definition for TC0 peripheral ========== */
#define PIN_PA04E_TC0_WO0                          _UINT32_(4) 
#define MUX_PA04E_TC0_WO0                          _UINT32_(4) 
#define PINMUX_PA04E_TC0_WO0                       ((PIN_PA04E_TC0_WO0 << 16) | MUX_PA04E_TC0_WO0)
#define PORT_PA04E_TC0_WO0                         (_UINT32_(1) << 4)

#define PIN_PA08E_TC0_WO0                          _UINT32_(8) 
#define MUX_PA08E_TC0_WO0                          _UINT32_(4) 
#define PINMUX_PA08E_TC0_WO0                       ((PIN_PA08E_TC0_WO0 << 16) | MUX_PA08E_TC0_WO0)
#define PORT_PA08E_TC0_WO0                         (_UINT32_(1) << 8)

#define PIN_PB30E_TC0_WO0                          _UINT32_(62)
#define MUX_PB30E_TC0_WO0                          _UINT32_(4) 
#define PINMUX_PB30E_TC0_WO0                       ((PIN_PB30E_TC0_WO0 << 16) | MUX_PB30E_TC0_WO0)
#define PORT_PB30E_TC0_WO0                         (_UINT32_(1) << 30)

#define PIN_PA05E_TC0_WO1                          _UINT32_(5) 
#define MUX_PA05E_TC0_WO1                          _UINT32_(4) 
#define PINMUX_PA05E_TC0_WO1                       ((PIN_PA05E_TC0_WO1 << 16) | MUX_PA05E_TC0_WO1)
#define PORT_PA05E_TC0_WO1                         (_UINT32_(1) << 5)

#define PIN_PA09E_TC0_WO1                          _UINT32_(9) 
#define MUX_PA09E_TC0_WO1                          _UINT32_(4) 
#define PINMUX_PA09E_TC0_WO1                       ((PIN_PA09E_TC0_WO1 << 16) | MUX_PA09E_TC0_WO1)
#define PORT_PA09E_TC0_WO1                         (_UINT32_(1) << 9)

#define PIN_PB31E_TC0_WO1                          _UINT32_(63)
#define MUX_PB31E_TC0_WO1                          _UINT32_(4) 
#define PINMUX_PB31E_TC0_WO1                       ((PIN_PB31E_TC0_WO1 << 16) | MUX_PB31E_TC0_WO1)
#define PORT_PB31E_TC0_WO1                         (_UINT32_(1) << 31)

/* ========== PORT definition for TC1 peripheral ========== */
#define PIN_PA06E_TC1_WO0                          _UINT32_(6) 
#define MUX_PA06E_TC1_WO0                          _UINT32_(4) 
#define PINMUX_PA06E_TC1_WO0                       ((PIN_PA06E_TC1_WO0 << 16) | MUX_PA06E_TC1_WO0)
#define PORT_PA06E_TC1_WO0                         (_UINT32_(1) << 6)

#define PIN_PA10E_TC1_WO0                          _UINT32_(10)
#define MUX_PA10E_TC1_WO0                          _UINT32_(4) 
#define PINMUX_PA10E_TC1_WO0                       ((PIN_PA10E_TC1_WO0 << 16) | MUX_PA10E_TC1_WO0)
#define PORT_PA10E_TC1_WO0                         (_UINT32_(1) << 10)

#define PIN_PA07E_TC1_WO1                          _UINT32_(7) 
#define MUX_PA07E_TC1_WO1                          _UINT32_(4) 
#define PINMUX_PA07E_TC1_WO1                       ((PIN_PA07E_TC1_WO1 << 16) | MUX_PA07E_TC1_WO1)
#define PORT_PA07E_TC1_WO1                         (_UINT32_(1) << 7)

#define PIN_PA11E_TC1_WO1                          _UINT32_(11)
#define MUX_PA11E_TC1_WO1                          _UINT32_(4) 
#define PINMUX_PA11E_TC1_WO1                       ((PIN_PA11E_TC1_WO1 << 16) | MUX_PA11E_TC1_WO1)
#define PORT_PA11E_TC1_WO1                         (_UINT32_(1) << 11)

/* ========== PORT definition for TC2 peripheral ========== */
#define PIN_PA12E_TC2_WO0                          _UINT32_(12)
#define MUX_PA12E_TC2_WO0                          _UINT32_(4) 
#define PINMUX_PA12E_TC2_WO0                       ((PIN_PA12E_TC2_WO0 << 16) | MUX_PA12E_TC2_WO0)
#define PORT_PA12E_TC2_WO0                         (_UINT32_(1) << 12)

